from utils.misc.user_utils import user_possibilities


def first_text(name: str):
    txt = [
        f'👨‍🦳 Привіт, {name}! Мене звати Платон\n',
        'Я буду твоїм віртуальним асистентом, '
        'моє основне призначення  - налагодження комунікації між учнями, репетиторами та освітнім центром.\n',
        'Для початку давай спробуємо знайти твій номер телефону в базі освітнього центру, '
        'так я зможу зрозуміти твою роль та наділити тебе відповідними повноваженнями.\n',
        'Для цього надішли мені його використавши відповідну кнопку ⬇️'
    ]
    return '\n'.join(txt)


def start_guest_text(user: dict):
    func = user_possibilities[user['role']]
    name = user['first_name']
    txt = [
        f'👨‍🦳 Привіт, {name}!\n',
        f'Ти наш <b>гість</b> і для тебе доступні наступні команди: \n\n {func} \n',
        'також ти завжди можеш повторно відправити номер телефону, щоб перевірити свою роль в системі\n',
        'Де кнопка ти вже знаєш 😉 ⬇️'
    ]
    return '\n'.join(txt)


def start_tutor_text(name: str):
    txt = [
        f'👨‍🦳 Радий Вас бачити, {name}!',
        'З чого розпочнемо?',
    ]
    return '\n'.join(txt)


def start_student_text(name: str):
    txt = [
        f'👨‍🦳 Привіт, {name}!',
        'З чого ти бажаєш розпочати?',
    ]
    return '\n'.join(txt)