from aiogram import types

from utils.requests.users_reqests import UserRequest


async def guest_info(msg: types.Message):
    txt = [
        f'Tutor-Math - це навчальний репетиторський центр, який допомагає учням поглибити знання з предметів '
        f'шкільного циклу, підготуватися до контрольних, творчих робіт, іспитів та олімпіад. Ми працюємо як в '
        f'онлайні так і офлайн, перелік центрів на нашому сайті https://tutor-math.com.ua \n\n'
        f'Цей бот виконує роль цифрового асистента нашого освытнього центру, '
        f'до його "умінь" можна віднести роботу з розкладом, балансом, '
        f'статистикою та іншими корисностями\n\n'
        f'Ми намагалися зробити максимально зручний інструмент, який був би завжди під рукою.\n'
        f'Спробуй сам та переконайся\n\n'
        f'Для початку потрібно стати учнем нашого центру, тарифи тут 👉 /pricing'
    ]
    await msg.answer('\n'.join(txt))


async def guest_pricing(msg: types.Message):
    prices = await UserRequest.get_prices()
    txt = ['👩‍🏫 <b>Абонементи / пакети послуг</b>\n'
           'Заняття в нашому освітньому центрі, орієнтовані на результат. Саме тому ми пропонуємо пакети послуг, '
           'основний принцип яких: більше займаєшся - платиш менше\n'
           'Обери зручний пакет послуг та натисни на команду для замовлення\n'
           'Наразі для тебе доступні наступні пакети послуг:\n'
    ]
    for p in prices:
        txt.append('🎁 <b>%s %s</b>, кількість занять <b>%s</b> всього <b>%s</b> грн. вартість одного заняття '
                   '<b>%s</b> грн. \n замовити 👉 /price_%s\n' %
                   (p.get('name'), p.get('group'), p.get('count'), p.get('price')*p.get('count'), p.get('price'),
                    p.get('id')))
    txt.append('\nОкрім того ти можеш скористатися пробним заняттям, спеціальна ціна чекає на тебе за посиланням '
               '👉 https://tutor-math.com.ua/trial-lesson')
    await msg.answer('\n'.join(txt))


async def guest_price(msg: types.Message):
    txt = ['Дякуємо за вибір']
    await msg.answer('\n'.join(txt))
